[
    {
		"media_outlet": "Montreal Gazette",
		"headline": "Montrealer’s Diwali book for children illuminates Hindu festival",
		"blurb": "Diwali, the festival of lights, is one of the most popular events in the world. Encompassing most of India and the South Asian diaspora, its celebrants number roughly a billion...",
		"link": "https://www.montrealgazette.com/entertainment-life/article178306.html"
	},
    {
		"media_outlet": "Sesaya Arts Magazine",
		"headline": "Mitali Banerjee Ruths celebrates South Asian culture in the vibrant Party Diaries series",
		"blurb": "With a deep-rooted passion for storytelling and a lifelong connection with diaries, Mitali Banerjee Ruths has woven a magical narrative series for young readers called The Party Diaries. Part of Branches, which is Scholastic’s early chapter-book line, The Party Diaries is a delightful fusion of the worlds of party planning, endangered animals, South-Asian culture and childhood learning.",
		"link": "https://www.sesayarts.com/mitali-banerjee-ruths/"
	},
    {
		"media_outlet": "Scholastic",
		"headline": "Exclusive Chat with ‘The Party Diaries’ Author Mitali Banerjee Ruths",
		"blurb": "I grew up around weekend parties organized by my parents and their friends. Our relatives lived far away, so our community became like an extended family of sorts. <br/>Parties bring us together. They make us feel happy and connected to each other. I wrote the first book and an outline for The Party Diaries in 2020, during the COVID-19 pandemic. For months, we had to stay in our homes, and we had to find creative ways to gather.",
		"link": "https://www2.scholastic.ca/scholasticblog/2023/05/11/exclusive-chat-with-the-party-diaries-author-mitali-banerjee-ruths/"
	},
    {
		"media_outlet": "CTV News",
		"headline": "Montreal author pens series about young party planner with a passion for endangered animals",
		"blurb": "Where do party planning, endangered animals, South Asian culture, and childhood learning moments collide? <br/>In The Party Diaries, a new series published by Scholastic, readers peek into the mind of Priya, a young party-planning entrepreneur with a passion for nature. <br/>Each book lays out the planning stages of a different party -- and just like in real life, these plans evolve as Priya grapples with new obstacles.",
		"link": ""
	},
    {
		"media_outlet": "Florida Association for Media In Education",
		"headline": "The Party Diaries selected for the 2024-25 Florida Sunshine State Young Readers Award (SSYRA) Junior List",
		"blurb": "The SSYRA, or Sunshine State Young Readers Award, is a statewide reading program in Florida for students in grades 3 through 8. The SSYRA program is sponsored by the Florida Association for Media in Education (FAME). In 2024, The Party Diaries Awesome Orange Birthday was selected for the SSYRA Junior List.",
		"link": "https://www.floridamediaed.org/ssyra.html"
	},
    {
		"media_outlet": "Maryland Library Association",
		"headline": "2024 Maryland Blue Crab Young Reader Award",
		"blurb": "The Party Diaries Awesome Orange Birthday is an Honor book for the 2024 Maryland Blue Crab Young Reader Award in the Transitional Fiction category.",
		"link": "https://sites.google.com/view/mla-csd/maryland-blue-crab-young-reader-award"
	},
    {
		"media_outlet": "Michigan Association of School Librarians",
		"headline": "THE PARTY DIARIES 1 and 2 have both been selected for the Lower Elementary category of the 2024 MI “MISelf in Books” List",
		"blurb": "I just wanted to share the good news that THE PARTY DIARIES 1 and 2 have both been selected for the Lower Elementary category of the 2024 MI “MISelf in Books” List. MISelf in Books is an annual list of inclusive books for Michigan learners. The list was created by a committee of certified school librarians who are members of the Michigan Association of School Librarians (formerly Michigan Association for Media in Education). These recommendations are based on books that they see learners reading and enjoying in their libraries. The books have been published in the last two years and are selected with a focus on authenticity. The list includes books for grade levels PreK-12. Learn more here and view the 2024 list here.",
		"link": "http://www.mimasl.org/miself-in-books.html"
	},
    {
		"media_outlet": "McGill Daily",
		"headline": "A Look Into Four Emerging Canadian Authors of South Asian Descent",
		"blurb": "New authors take root in “The Garden of Literary Delights”",
		"link": "https://www.mcgilldaily.com/2024/10/a-look-into-four-emerging-canadian-authors-of-south-asian-descent/"
	},
    {
		"media_outlet": "Publishers Weekly",
		"headline": "Noteworthy Picture Book and Novel Sequels",
		"blurb": "In picture books, Archie Celebrates an Indian Wedding, the follow-up to Archie Celebrates Diwali, Archie teaches her friend Emma all she needs to know about Indian traditions in time for her uncle’s festive wedding.",
		"link": "https://www.publishersweekly.com/pw/by-topic/childrens/childrens-book-news/article/94836-noteworthy-picture-book-and-novel-sequels-april-2024.html"
	}


]